node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2756667
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\006\355\257=\346\373[\276\335\257\207\272\347\275G\275\177]\233\274N\220\\>\221^\212\275:\3231>\027\311l>\235\332\035\276e\216\234=\350T\206=}\260E\276\311\310\317\275\350\252\016\276\327|\216\274\005\217\037>L\324_\276P\317R\274\242\367\334\275Y\345%>\255\335A>\355D\346=\256h\206>\231\351|\275\205O\037=\316\272l\275\207A\004>\025\352\243\275\214{\237\273\214\274\'<\247\357T>\366\340\331\274\250t\261=\014\254\276=\005Q\265=\244|\005=\353\017\226>\335\326\243=(\177\006\276I\251#\276\327\331\203=\235\306\215=\320\204\226\275\007\024K\276r\323\232\275B\276\000>\357\0033>\333\332\315\275\257\352\247=\376\267>=q\235^>~c\240\275{\257#>j\223F=\301l\"\276\325\267|=7\334>=\352w\001\2752\020\242=\010\233J\276\246\374\016>\2148z<\365P\320<\211q\272\275\247\342\275<\362\255\223=\230\357\206>\216\247\035=\360\010@>\'\354\006>\374\356\277\273\316o+\276\001\223\032>\304_D>S?\252>\374\035\322=\000\022\350\275`XL\276d\346D\275Y*\t\275\"\307\025>W1\337\274Q\307\276\274\334\200\223\276Yl\301=\202m\003\275\270\307\357\274\357M\017>e9{\275\354\350K\276\372\270\334=\247\264(>\353\235\377\275:{\205\275\226\263!;\352\344]\276\220\031I\276\330\2301>d\272\215=\370\037(\275R\252\006\273\377\233\026\276\266g\262<\007\220\370=8r\244\275\000.[\275/\3252>\206\t\000\276_k-\275\324\255\240\274\021\256\352\273\'2!\276\014X\336\275\303iC=I6\242\275\264\212\202\275\265?\036>\305f\223\275\211\220\224\275\014\221\353=M\250\201=\006w\010\275t\271\234<T\204\353\275:\346\016>\326\230@>-\230O\276\214lq\275V\266<>\377s\007\276\357\311\022\275\275\362t\275\345)\323=&\273;</\377b\276[O\212=\336\371\336=w}~=D\323\252=8L\022=\213\201\016>5|\365\275g\360)>47*\275X\307\004\275\232\326\032\276\363\231v=\'t\">\356\003\305=\014vF\276\343R\216\275wR~\275\214\346O\276\353\301Z\275\2129\327\275.\264\346\275p\377(>\234\254\233\274\250\177\205>\017\271\350\273\356\367\203=(\242\312=n\276:\276\313\240\014>\300\370\021>\031B\244=\014\357(\2759\213\247\276)\333%>Y\366L=zi\256=D\177!>\337\013\351\275\333\030\033>-\002L\276\313\3447>\010@\344\275b\341i=S\243j\275\311\t\003>\306\272F>\001S\347\275\267\3224\276\251bU>V\320\212\273\244q\320\275\353\\a\276\210\010\320\275\304BG>\242y\303<\353\214\200=\236a\264\275)\314\013>aA/\276\223\r\270=\005]\251<\337\324X\275\210\214\307<\312\224v\275\334\214,\274\236J\">\274\254\016\276i\222\304\275\376\220\025\275\361\370\017>\242\323 \276\014E\265<\306\237\246\275\021Q\201>(\035P\275V\3028>\024\0022=\246\366=\272\255\223-=\265\345\366=\245\221@>Z\207\220=\031M\"\276A\377\030\275E\203m\276\033\037\274=\363\3335\276\315-\001\276\350b\212\2740\032\263=\2649@=\205dV=y\270x>\225/3\2754M\004>\022O\'\275\277\374\376;p\020\n\276\242\t3>\203\0315>\330\352\217\275@\025\350\274\255\256\233\276\315\016\221\275\337\351h=\364\325x>\337\n\221\275\253\274\355<\335m\253\276\353\"L=\031\375\030\275\344P\344\275\006\0026\276\345P\014\276\224-y\274J3\363=\224\244h=\322\037\321=\034\246\345\275\222]t>I$\036=\203\204\321<\032=;\275\264\364*\275M\210\210=\032`P=\310\000\037>\357\030L>!4r=K\226\222\276\307\337S>\357L\241=\356\227#>Yi\275\274\277u\305=\353\263\271\274\304\355\033=\317P\027>\236\322\343\275<r.\275=\317G\275\305\203\215\274\364\235\204\2767+\230<C/\317=\010\204a<\242E\200\275\025\334\342=\023Kl\276\360&\375=V\324\266=2\342\252\275\037\363\214\2751S\266=*$\301=\303m\235\275\254\215\013<\360\345\214=\227\306(>6G\222\275z\373\006\276\330)\215>\313\237)\276\001\263\225\275\263\".\274\333.\271=c\342\020>J\2432>\237\305,\276h3\221\2755\254\025<\215^\345\273\260|c=\201\2759\275\214EE>\010\360\001>8\035\335=\3044:>x\r\003>b\021F\276\304\204g>\005\272\307\275_5\241\275r\352Q\276\002,7>\320qT\276\341\031\275\2751\250\246=\301ST=}H6>\302\341O\275\001\341B\275\310\220\007\276\231\\\352\274\010\361\377=h\361.;\217\373\275\276\201L\031>(\003\022\276\217bQ\275\220\216>=zr\n\276\n\245\231=~J@>$1e\274\316\3662>\310Df\276J\354\212<\360\362n\275\234\255a<\363\325\316\275\023\324\231\274B\240\230=Y\376\342=\365\335\037\274\345\276;=\363\276&\276\007\320\274\274t1H>\026\254\263< \032\274=o4M\276\032\262H\275`\031&\275\331\362\035>\353\212\353=\275\322\037=\006\"0=\323#2>\201\212\202=\302\311\031\276\301-%>\030>>\276yG\353<\251\320z<\014\331#\275{\330\254\275\014\'\362\275\367\017>:\025K\201\276\211\032I>\3661v\275=\371H<\236B\216\275r\200\332:\006^T>\016g\212<\3745\253\275h_\224=\022\330\024=\304\000#=\250\212\372\275\244r\201\276\003\2447;\325\374q\275SI\005\275\203n#\275#\013\252\275G\203Q>%\351O\276\214V\235=\254B\263\275.~\016\276\330\315`<\221\214\213=Q\215\211\275\254\263\016\276N-&>\320L\356\275\370\241\231=<U~<\314\326d<7\022\330\276\226\221\013=:\374,\275#\335\247\276S\037 \276\366\3571\275\251\337 \276\344.\200\275\317\371\013\276\344X\\<\360\335z\275\020\225\224<\321N\r\276\2573\006=\223\305#\275=\230W\276\314=l>x\354\365\274\263\203>=]\375\003=\227$\220=-\363\002\276&%\226=^j\351\275U\352\212>4h8=\306\000\017=W\0012>\304\n\216=$\340\\=\206\271\350<a\306\027\276\261\251\247\275f<\000\276=\375\305\275\313@\370=\235\'\034\275\247Y\201>x\013\254=\2107\024>\007\377\006\275\311S\256>\004\377Y\275\264\177\214\275V\261 >\357E\204=\\vh=+} \276\036b\037\275\036\250\004\276AIN\276\370\336?\274W\022v=\352r\243>\337\243g>\022\320\220=\2333\373\274\316\375\370\274\241o\366<\217\253l=\020\261\001\276\016\024\205=\345\301J\275b\216\353\272#\321\027=\002\035;>s\'\256=D\277H\276\207\276\374\275s\356\022\276\327\257\263=M\272\221\275\031\275\346\275,\377\322<Y\271I\276:\232\332=\266\254&\276\214\225\233\275\347IO=\360\314\356=\226\n\257\2744f\200\275\303\367=\27432\n\276\3471\347\275*\216\013=*L\013\276\222R\231\276\t\2100\276[K\023>U`\360=\026\361\336\275U\314\335\275\347(M=\342\\\353\274M\227\306\2761\r>\276\206[\006\275yW\221\275\377FR>\204e\237\274\316\340\253\275\022\342\362=hjr>\256\233\367\273\332\251f=\2307\324\274\303zm\275\204\201\205\276&p\271\275\000\326\277\275\244\354\202\275\346c/>\\\367\366=\220\357\301=\200\003\216\275\245_\352\275\304:\216=\212\3423>\214\360\322=\254\343,=\211@\016>\320\034\275\275]@\006>\216\264\371\275vF:\274\345\n\320;\010\346\032\273i\021\327\275\n\354\n\276W\314C\276^\300o<@\247Z>\024/\334=\375\307?<\263zL=\271\334\236;\265@)=\220\315L\275\254\347b=\205\316\026\276W\017\341\275O\312@>\264\213\243\275\270\203\225\276g}V=\365\017|>1\245O=A\021\007\276\360\3028=\205\345\227\275/#\360=a.\266\275X\214\002>Q\272\t\275\256{\245=w\256\n=\355\257\336<r\235\330=\345f_<\314p\274=\030U:<uL\304\2753t\224=V)\'\275\326K\026\275;k\354\273\010\273\010>\003^\270>\306n%\276\006\337Z=\361b)\276\235%Z>,\356V>2\343\256;\375\304\034=\354\300Z=\006\321\270<\246\013;>\000\242\346\275\317\276\001\275\304a\351=\224\002\264\276H\"\n>\341\232\333=^\255\023> \276\254=?E->!\216\026>\005\314\212\275U\237%=\312u\254<PHI\276yi\023\276\216\222\300>\361\006I\2767\303A=\247I\035=\370\013=\276\002\361\"\275\305$\021\276n\253\'>/n\326=\314j\241\273\357\327\022\276\243z\036>\341\223\313\275*\r&\276\250O\271\275\256\242A\276\270\331G\2754\301\323\275\251\000\263\275J\272m\275F\263\210\276q\277\357=\2163%<\035F\317\275~\230\242\274VKc>\333M\275=7W\021\276\350e\377:\357l8\276\363\364R=\2063!=\206C\t>\036\357\007\276\242s\264\274\343\215 \275\205\311\n>\317\333i\276\321\330Z>~<\261<@\004\366;GX\306\275\346\215Y=l\273\\\274\361\364\375<\014\371J\276xT\013=\273\325\316=\037P{>sX\037\2750\245\375\274x\242\201=\371c\020=\361.^\274v\222/\275QC\204=(P\307\275<\264G\275\215\022\241\273TV\n\276\365j~=\001)\271=\202Ln\275pA\214\276\267\206\031>\266i\356<\334\331\236\275\332\375?=\364LU>LJ\006>w\244e<\304\361\036=\250\033Y\2762\315\"\275\326\377\336\275\217\363x=#G\034\276\372?\340\274\367\377X\275}\030\205>j\315=\274\243\223\326\275\236\256\272\275l\207\324\274l\256\010\275n\001\206\276\244o\314=\225\232g<\336x\315;\363]\220=\037\220\356\274\246}\302\275z\266s\275\016\372\240\275\332\021\255= \260\230<\227\230\037\276\177\213\004\276\334\304-\276\267#\375=m\'\226=\217\344\316\274\005\305\231\275\237\2343\276\304\377A\276\367\364\246\275W\241\222\275\217\234U>\203\021.>\027o\215\275\275\360\214<\031\005\310=gOL>\256)\240=\024\324\020\276\350\350\241<\276K\277>\030\364N>\035\304\024\276\tr\257\274\277\311@\276ti\372=\233\213\346<\274\356#=\205\326>\274{NP\275 M\374=\034\033`\276\321\033\207\275\340\324\036\276\031\216&\276S_\017>^\345\177=B\352Q=F||>\236\243\221\275\242\233\214>NSa=\227\242\324\275\367\302=\275X\314\237\274c\024\001\276&Q{;2\310\225\275\243c\224=\325o\260\275Z\371\212>\302&[\276\313\233e\275\215\231(\274\203\000w\275\016\213z\275\006,\236>\244\201\231\275r\027\337=e\017\227\275l\204Y\275\3179\306\275N\322\205\276ux\377<Z\220\374\275\007_\332=\201\001\325=\r\300\260=`\231A\2741~\177\275\257y:>\365\202\365=\347\215\000>\035E6\276V\250,=\2540\357=\177\264\363=\036wx\276]O\247=\274v\004\276\177`\373:\\\030\'=\262zy\275\352\323l\275:\010\r\275\025F+>\347sk\276\361\246\355\273\371\027j\276M\371\006\274\315\033\037\276\350\334\005\275Y\243$\275\221\3229>\330\334b\276\353\354G\275\266\207\"= \350\325\274\024\306\021>\205\022\200>\275\245\341\274\347\365\341=\274\204\t\276p\022_\276\252\261\"=\364R\231<\022\272\317\275\273\253F>\n\232\262<\224\367\031>^/(\276\312\346\020=\345\360\256\275\301\323\221<\335( >\177\324\315\275\'\3315>\312g=\276\'\244\r\275y\020\353=\242\232\252\275g]\035=|\206\237=\236H\372=H\307\356\275\323\226I=Rg\253\275\325ZD\276Z\206\255\275uB\322<+?\325\274\030\017\262\276l\2247>l\211\250=\003#?>\237\337-=\330I\034>/C\357=H\256\323=\267\370<\274\326P\375<\342\r\007>.\3707=B~\251\274V\301>=\223G1\276\347]\227\273xx\311=\2503\227=\224\245;>\300\212Z\276\335\262\317=\226\200N\274\203\257_=\314^\n=g\275\204\275\010@\337\267\236\263\262\275z0\203\275\021\302\211\273\265\220\373=\370\214\327\274\332f\335;2L\355=U\0225\274\177\270\241\274\017\231|\276\244X\254<\237\246\264>\267\274:\275\332v >`\035\353\274\033\'/\276\035gN\276\243\233\250\2755.\207>=\023\241=\373\'\327\275%\224F=\t\217\363;\016\326\010>\344\250D>(2A\276\n\020\223<}8P>\300\266}>\317\323\007\276\337\302h>\275\277\331<{\214\274=\350v\005>\037\372\016\276\240\222\242=S\351\027>\271\313\306\275A\221\315\275\306u\276=\016\201:>?\027\"=\336Q\365\275JCy<t\224\007>\334\014\203>9+\364<\0219b>\2466\364<Tl\t>\256\200\025\274\374\273\207<\024N\212\275Y\200G=\027}7>5\306-\276\277\333z\275\343\240\t\274?\260R\274\276;\257=\371\342\017>$#\221=e9\261<\027\226H>\000\031\342\275\200-\013>\363?\303=Ow\326=\243\034\"\276h\367\370=\314\262\027\2752\014$<\\c\016>\357l\004\274~T\243\276\235\336\\>r\204\013\275\313#\000>\271\037\027\275\nz\016=q\025\003\276\230\032e\275\273\302\027\274o\351\014\276\345\025\350\274\244\327J\275\317\364\236>\341i\031>\251\325}\275\274\227\200=\303w\025\276e\206B\275\014\227\264\274^\265Z\272}1$\276\373\206\002\2769\244(=\337\354\216\276\235\316\243\275n\245{>Zs1=\364\326\037>j\316\016>\274\332\346=~\252\210\275\227\275M\2763\213[>\341\000\234=\241\305><\207\326\234<\2219.\276\255\250\007\276\211\226\354=\225\306\222<\274VR\275\234\321\203=\370\234A=\336$\367\275,`\243=\254\223V\275\354;\031={x^\274e\236\371=\r0|\272\347\335\205\276\301W#\275\177LB=A\243\253=\351\216<=\244\347/;k\336W=\024\021(\275\361\"\372\275\034\240\034\275\260I\364\275\312L%\276\345\270n=\267\367\372\274\301\202\004>%r\211\275\001\216;=\224r\031\275k+\267>\245\237g\275\020S5\276i\253\262=U\235\237\275\224\352L>o\306\367\275\\\0021\272{\205\275>\3008O\276\306=2\2757\265K<gZI\276\222\365.\276\'\217L\276\336(V=\006\\\021\274b\274<=l\000\231\275t\317J>_h\311\275\251L\334=\020\205D\276\353\310]\275\377k\232\275\202lW>\307V\274\275\034\267\'\276\235\2250>\016\017 \276\343\363\006\273\371$>=m\215\225=\224\025O>`\2746\276\263gB>s\033D\276\242<2>f\322=\274\211\n\301\275a\347\324=A\237\t=\323Q\221=Sw\026>D6l>\254\235K=B\367\367\275\000f\273=S\332\033>a|/>\366\262\212\275\333\334\234=\000\246\353=\335\305x;YY4>7\327$\276\246\321\313\272$\032\250=.\305\260<\023>\211\276\350\240)=\331\rw\276\330\264I\276q\320\322\274\262;%\276\317x \276{M\023>z\361\376=\276\037\260\275\205\3138=0\253\314\275(\307\207<\001\252\344\272\347\013\350=\247{\305=}\367\352=P\364\033\275\245\222\355=\221]\316\272\225\340\324=\0235\337\275[\013\260\274\367\310s\276]\375}=w\206\347\275\332u\013>\210\014\n\275\027\244\014\276\211D\351<\206\3050\2765s\310\275\030\227A\2767\234P\275\036\005\335\274\223\026)>Q\275\007\276\341[\363=#\253\241<NV\003=\270S`\275BI\222;\373c\000\275\034\300\013>8\r\243\2754\022\320<Y3j>\205i\t\275*=n>+\240\014>\213\373 \276x\215\260\275\033\245\213>=\222^>\356\204->\\\2042>[:m=\314\317D<j\264D>\325\372\240\275K\026\010=\017\270<<\243\240$>i\025\003>!\3469=j\276\\=\204\212B>\305\222\307=\253c\276\274tz\036=4IM\276J)\242=\335\023\333=\250\246\202=p\247\253\275\362\257b=\357\212O\276s\1772\276\242\220\013\276\317\213l\276\211\367C\276\373z\r\276\320\317\341<:\335\026\276\232\301\262\276r\376\336=\332hm>\336\333\352=u`W>~\265\\\276\361C\255\275\\|2\276\277\001\306\275P\262\007\276\014\310\272\274\345\377\260=z?1=I>*\275\361{\037>6p\007>\223k\225;\222<\376=\035\007<\274Ew\237>\362 :>\332\363\212=\276\263/\276\0273\244;\371\233N=\351,\037\275\325&*\276\270\024\341=\025\033.\273}\315p\275\277\244\322\275Q\\\016>\037\241\350\274\337o\212=\013,\023\275\326\200\206\275\270\334k=\tB]\274\245V\312\275\364\262\242<\243z\314\275\214qA\276\312?!>\350E\234=\025E3\276\323n\302\272\t~C>\366C\334=F\201\266\275\233\006\322=t#\335<\027\326\250=\367hL\2761\305.\275\214d\013\2741\347\t\2748\2353>(\257\030\274\001\250\232\275\302Qe>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
